---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisMode
source: html/a4d5128f-91e8-06f4-c5c5-72ba0f705a48.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisMode

This enum is used to define the Energy Analysis Model.

## Syntax (C#)
```csharp
public enum AnalysisMode
```